---
kind: type
id: T:Autodesk.Revit.DB.BuiltInFailures.DividedPathFailures
source: html/96557f40-4ea3-021a-cde7-1f67aeef1a16.htm
---
# Autodesk.Revit.DB.BuiltInFailures.DividedPathFailures

Failures related to divided path operations.

## Syntax (C#)
```csharp
public static class DividedPathFailures
```